abdosalem490/stm32f407-drivers/drivers/HAL/CM4F/CM4F_reg.h
/******************************************************************************
 * Bit Definitions for registers
 *******************************************************************************/

/**
 * @brief: represents bit position and lengths for CPUID base register, Reset value: 0x410F C241
 */

// bit positions
#define HAL_CM4F_CPUID_REVISION_POS 0	  /**< Revision number. The p value in the rnpn product revision identifier, indicates patch release. 0x1: = patch 1*/
#define HAL_CM4F_CPUID_PART_NO_POS 4	  /**< Part number of the processor. 0xC24: = Cortex-M4*/
#define HAL_CM4F_CPUID_CONSTANT_POS 16	  /**< Reads as 0xF*/
#define HAL_CM4F_CPUID_VARIANT_POS 20	  /**< Variant number. The r value in the rnpn product revision identifier. 0x0: revision 0*/
#define HAL_CM4F_CPUID_IMPLEMENTER_POS 24 /**< Implementer code. 0x41: Arm*/

// bit lengths
#define HAL_CM4F_CPUID_REVISION_LENGTH 4	/**< uses 4 bits*/
#define HAL_CM4F_CPUID_PART_NO_LENGTH 12	/**< uses 12 bits*/
#define HAL_CM4F_CPUID_CONSTANT_LENGTH 4	/**< uses 4 bits*/
#define HAL_CM4F_CPUID_VARIANT_LENGTH 4		/**< uses 4 bits*/
#define HAL_CM4F_CPUID_IMPLEMENTER_LENGTH 8 /**< uses 8 bits*/

/**
 * @brief: represents bit position and lengths for Interrupt control and state register (ICSR), Reset value: 0x0000 0000
 */

// bit positions
#define HAL_CM4F_ICSR_VECTACTIVE_POS 0	 /**< VECTACTIVE Active vector. Contains the active exception number. Subtract 16 from this value to obtain CMSIS IRQ number required to index into the Interrupt Clear-Enable, Set-Enable, Clear-Pending, Set-Pending, or Priority Registers*/
#define HAL_CM4F_ICSR_RETOBASE_POS 11	 /**< Return to base level. Indicates whether there are preempted active exceptions*/
#define HAL_CM4F_ICSR_VECTPENDING_POS 12 /**< Pending vector. Indicates the exception number of the highest priority pending enabled exception.*/
#define HAL_CM4F_ICSR_ISRPENDING_POS 22	 /**< Interrupt pending flag, excluding NMI and Faults.*/
#define HAL_CM4F_ICSR_PENDSTCLR_POS 25	 /**< SysTick exception clear-pending bit. Write-only. On a read, value is unknown.*/
#define HAL_CM4F_ICSR_PENDSTSET_POS 26	 /**< SysTick exception set-pending bit. */
#define HAL_CM4F_ICSR_PENDSVCLR_POS 27	 /**< PendSV clear-pending bit. This bit is write-only. On a read, value is unknown.*/
#define HAL_CM4F_ICSR_PENDSVSET_POS 28	 /**< PendSV set-pending bit. Writing 1 to this bit is the only way to set the PendSV exception state to pending.*/
#define HAL_CM4F_ICSR_NMIPENDSET_POS 31	 /**< NMI set-pending bit. Because NMI is the highest-priority exception, normally the processor enter the NMI  exception handler as soon as it registers a write of 1 to this bit, and entering the handler clears this bit to 0. A read of this bit by the NMI exception handler returns 1 only if the NMI signal is  reasserted while the processor is executing that handler.*/

// bit lengths
#define HAL_CM4F_ICSR_VECTACTIVE_LENGTH 9  /**< uses 9 bits*/
#define HAL_CM4F_ICSR_RETOBASE_LENGTH 1	   /**< uses 1 bits*/
#define HAL_CM4F_ICSR_VECTPENDING_LENGTH 7 /**< uses 7 bits*/
#define HAL_CM4F_ICSR_ISRPENDING_LENGTH 1  /**< uses 1 bits*/
#define HAL_CM4F_ICSR_PENDSTCLR_LENGTH 1   /**< uses 1 bits*/
#define HAL_CM4F_ICSR_PENDSTSET_LENGTH 1   /**< uses 1 bits*/
#define HAL_CM4F_ICSR_PENDSVCLR_LENGTH 1   /**< uses 1 bits*/
#define HAL_CM4F_ICSR_PENDSVSET_LENGTH 1   /**< uses 1 bits*/
#define HAL_CM4F_ICSR_NMIPENDSET_LENGTH 1  /**< uses 1 bits*/

/**
 * @brief: represents bit position and lengths for Vector table offset register (VTOR), Reset value: 0x0000 0000
 */

// bit positions
#define HAL_CM4F_VTOR_TBLOFF_POS 0 /**< Vector table base offset field. It contains bits [29:9] of the offset of the table base from memory address 0x00000000. When  setting TBLOFF, you must align the offset to the number of exception entries in the vector  table. The minimum alignment is 128 words. Table alignment requirements mean that bits[8:0] of the table offset are always zero . Bit 29 determines whether the vector table is in the code or SRAM memory region.*/

// bit lengths
#define HAL_CM4F_VTOR_TBLOFF_LENGTH 21 /**< uses 21 bits*/

/**
 * @brief: represents bit position and lengths for Application interrupt and reset control register (AIRCR), Reset value: 0xFA05 0000
 */

// bit positions
#define HAL_CM4F_AIRCR_VECTRESET_POS 0	   /**< Reserved for Debug use. This bit reads as 0. When writing to the register you must write 0 to  this bit, otherwise behavior is unpredictable.*/
#define HAL_CM4F_AIRCR_VECTCLRACTIVE_POS 1 /**< Reserved for Debug use. This bit reads as 0. When writing to the register you must write 0 to  this bit, otherwise behavior is unpredictable.*/
#define HAL_CM4F_AIRCR_SYSRESETREQ_POS 2   /**< System reset request. This is intended to force a large system reset of all major components except for debug. This bit reads as 0.*/
#define HAL_CM4F_AIRCR_PRIGROUP_POS 8	   /**< Interrupt priority grouping field. This field determines the split of group priority from subpriority.*/
#define HAL_CM4F_AIRCR_ENDIANESS_POS 15	   /**< Data endianness. bit Reads as 0.*/
#define HAL_CM4F_AIRCR_VECTKEY_POS 16	   /**< Reads as 0xFA05, On writes, write 0x5FA to VECTKEY, otherwise the write is ignored.*/

// bit lengths
#define HAL_CM4F_AIRCR_VECTRESET_LENGTH 1	  /**< uses 1 bits*/
#define HAL_CM4F_AIRCR_VECTCLRACTIVE_LENGTH 1 /**< uses 1 bits*/
#define HAL_CM4F_AIRCR_SYSRESETREQ_LENGTH 1	  /**< uses 1 bits*/
#define HAL_CM4F_AIRCR_PRIGROUP_LENGTH 3	  /**< uses 3 bits*/
#define HAL_CM4F_AIRCR_ENDIANESS_LENGTH 1	  /**< uses 1 bits*/
#define HAL_CM4F_AIRCR_VECTKEY_LENGTH 16	  /**< uses 16 bits*/

/**
 * @brief: represents bit position and lengths for System control register (SCR), Reset value: 0x0000 0000
 */

// bit positions
#define HAL_CM4F_SCR_SLEEPONEXIT_POS 1 /**< Configures sleep-on-exit when returning from Handler mode to Thread mode. Setting this bit to 1 enables an interrupt-driven application to avoid returning to an empty main application.*/
#define HAL_CM4F_SCR_SLEEPDEEP_POS 2   /**< Controls whether the processor uses sleep or deep sleep as its low power mode.*/
#define HAL_CM4F_SCR_SEVEONPEND_POS 4  /**< Send Event on Pending bit. When an event or interrupt enters pending state, the event signal wakes up the processor from WFE. If the processor is not waiting for an event, the event is registered and affects the next WFE. The processor also wakes up on execution of an SEV instruction or an external event*/

// bit lengths
#define HAL_CM4F_SCR_SLEEPONEXIT_LENGTH 1 /**< uses 1 bits*/
#define HAL_CM4F_SCR_SLEEPDEEP_LENGTH 1	  /**< uses 1 bits*/
#define HAL_CM4F_SCR_SEVEONPEND_LENGTH 1  /**< uses 1 bits*/

/**
 * @brief: represents bit position and lengths for Configuration and control register (CCR), Reset value: 0x0000 0200
 */

// bit positions
#define HAL_CM4F_CCR_NONBASETHRDENA_POS 0 /**< Configures how the processor enters Thread mode*/
#define HAL_CM4F_CCR_USERSETMPEND_POS 1	  /**< Enables unprivileged software access to the STIR*/
#define HAL_CM4F_CCR_UNALIGN_TRP_POS 3	  /**< Enables unaligned access traps. If this bit is set to 1, an unaligned access generates a usage fault. Unaligned LDM, STM, LDRD, and STRD instructions always fault irrespective of whether UNALIGN_TRP is set to 1.*/
#define HAL_CM4F_CCR_DIV_0_TRP_POS 4	  /**< Enables faulting or halting when the processor executes an SDIV or UDIV instruction with a divisor of 0.*/
#define HAL_CM4F_CCR_BFHFNMIGN_POS 8	  /**< Enables handlers with priority -1 or -2 to ignore data bus faults caused by load and store instructions. This applies to the hard fault, NMI, and FAULTMASK escalated handlers. Set this bit to 1 only when the handler and its data are in absolutely safe memory. The normal use of  this bit is to probe system devices and bridges to detect control path problems and fix them.*/
#define HAL_CM4F_CCR_STKALIGN_POS 9		  /**< Configures stack alignment on exception entry. On exception entry, the processor uses bit 9 of the stacked PSR to indicate the stack alignment. On return from the exception it uses this stacked bit to restore the correct stack alignment.*/

// bit lengths
#define HAL_CM4F_CCR_NONBASETHRDENA_LENGTH 1 /**< uses 1 bits*/
#define HAL_CM4F_CCR_USERSETMPEND_LENGTH 1	 /**< uses 1 bits*/
#define HAL_CM4F_CCR_UNALIGN_TRP_LENGTH 1	 /**< uses 1 bits*/
#define HAL_CM4F_CCR_DIV_0_TRP_LENGTH 1		 /**< uses 1 bits*/
#define HAL_CM4F_CCR_BFHFNMIGN_LENGTH 1		 /**< uses 1 bits*/
#define HAL_CM4F_CCR_STKALIGN_LENGTH 1		 /**< uses 1 bits*/

/**
 * @brief: represents bit position and lengths for System handler priority register 1 (SHPR1), Reset value: 0x0000 0000
 */

// bit positions
#define HAL_CM4F_SHPR1_USG_FAULT_POS 20		 /**< Priority of system handler 6, usage fault*/
#define HAL_CM4F_SHPR1_BUS_FAULT_POS 12		 /**< Priority of system handler 5, bus fault*/
#define HAL_CM4F_SHPR1_MEM_MANGE_FAULT_POS 4 /**< Priority of system handler 4, memory management fault */

// bit lengths
#define HAL_CM4F_SHPR1_USG_FAULT_LENGTH 4		/**< uses 4 bits*/
#define HAL_CM4F_SHPR1_BUS_FAULT_LENGTH 4		/**< uses 4 bits*/
#define HAL_CM4F_SHPR1_MEM_MANGE_FAULT_LENGTH 4 /**< uses 4 bits*/

/**
 * @brief: represents bit position and lengths for System handler priority register 2 (SHPR2), Reset value: 0x0000 0000
 */

// bit positions
#define HAL_CM4F_SHPR2_SVCALL_POS 28 /**< Priority of system handler 11, SVCall*/

// bit lengths
#define HAL_CM4F_SHPR2_SVCALL_LENGTH 4 /**< uses 4 bits*/

/**
 * @brief: represents bit position and lengths for System handler priority register 3 (SHPR3), Reset value: 0x0000 0000
 */

// bit positions
#define HAL_CM4F_SHPR3_SYSTICK_EXCEPT_POS 28 /**< Priority of system handler 15, SysTick exception */
#define HAL_CM4F_SHPR3_PENDSV_EXCEPT_POS 20	 /**< Priority of system handler 14, PendSV */

// bit lengths
#define HAL_CM4F_SHPR3_SYSTICK_EXCEPT_LENGTH 4 /**< uses 4 bits*/
#define HAL_CM4F_SHPR3_PENDSV_EXCEPT_LENGTH 4  /**< uses 4 bits*/

/**
 * @brief: represents bit position for System handler control and state register (SHCSR), Reset value: 0x0000 0000
 */

// bit positions
#define HAL_CM4F_SHCSR_MEMFAULTACT_POS 0	 /**< Memory management fault exception active bit, reads as 1 if exception is active. */
#define HAL_CM4F_SHCSR_BUSFAULTACT_POS 1	 /**< Bus fault exception active bit, reads as 1 if exception is active. */
#define HAL_CM4F_SHCSR_USGFAULTACT_POS 3	 /**< Usage fault exception active bit, reads as 1 if exception is activ. */
#define HAL_CM4F_SHCSR_SVCALLACT_POS 7		 /**< SVC call active bit, reads as 1 if SVC call is active. */
#define HAL_CM4F_SHCSR_MONITORACT_POS 8		 /**< Debug monitor active bit, reads as 1 if Debug monitor is active. */
#define HAL_CM4F_SHCSR_PENDSVACT_POS 10		 /**< SysTick exception active bit, reads as 1 if exception is active. */
#define HAL_CM4F_SHCSR_SYSTICKACT_POS 11	 /**< SysTick exception active bit, reads as 1 if exception is active. */
#define HAL_CM4F_SHCSR_USGFAULTPENDED_POS 12 /**< Usage fault exception pending bit, reads as 1 if exception is pending. */
#define HAL_CM4F_SHCSR_MEMFAULTPENDED_POS 13 /**< Memory management fault exception pending bit, reads as 1 if exception is pending. */
#define HAL_CM4F_SHCSR_BUSFAULTPENDED_POS 14 /**< Bus fault exception pending bit, reads as 1 if exception is pending. */
#define HAL_CM4F_SHCSR_SVCALLPENDED_POS 15	 /**< SVC call pending bit, reads as 1 if exception is pending. */
#define HAL_CM4F_SHCSR_MEMFAULTENA_POS 16	 /**< Memory management fault enable bit, set to 1 to enable. */
#define HAL_CM4F_SHCSR_BUSFAULTENA_POS 17	 /**< Bus fault enable bit, set to 1 to enable. */
#define HAL_CM4F_SHCSR_USGFAULTENA_POS 18	 /**< Usage fault enable bit, set to 1 to enable. */

/**
 * @brief: represents bit position for Configurable fault status register (CFSR; UFSR+BFSR+MMFSR), Reset value: 0x0000 0000
 */

