abdosalem490/stm32f407-drivers/drivers/HAL/CM4F/CM4F_reg.h
// Usage fault status register (UFSR)
#define HAL_CM4F_CFSR_UFSR_DIVBYZERO 25	 /**< Divide by zero usage fault. When the processor sets this bit to 1, the PC value stacked for the exception return points to the instruction that performed the divide by zero.  */
#define HAL_CM4F_CFSR_UFSR_UNALIGNED 24	 /**< Unaligned access usage fault. Enable trapping of unaligned accesses by setting the UNALIGN_TRP bit in the CCR to 1*/
#define HAL_CM4F_CFSR_UFSR_NOCP 19		 /**< No coprocessor usage fault. The processor does not support coprocessor instructions:*/
#define HAL_CM4F_CFSR_UFSR_INVPC 18		 /**< Invalid PC load usage fault, caused by an invalid PC load by EXC_RETURN: When this bit is set to 1, the PC value stacked for the exception return points to the instruction  that tried to perform the illegal load of the PC.*/
#define HAL_CM4F_CFSR_UFSR_INVSTATE 17	 /**< Invalid state usage fault. When this bit is set to 1, the PC value stacked for the exception return points to the instruction that attempted the illegal use of the EPSR. This bit is not set to 1 if an undefined instruction uses the EPSR.*/
#define HAL_CM4F_CFSR_UFSR_UNDEFINSTR 16 /**< Undefined instruction usage fault. When this bit is set to 1, the PC value stacked for the exception return points to the undefined instruction. An undefined instruction is an instruction that the processor cannot decode.*/

// Bus fault status register (BFSR)
#define HAL_CM4F_CFSR_BFSR_BFARVALID 15	  /**< Bus Fault Address Register (BFAR) valid flag. The processor sets this bit to 1 after a bus fault where the address is known. Other faults can set this bit to 0, such as a memory management fault occurring later. If a bus fault occurs and is escalated to a hard fault because of priority, the hard fault handler If a bus fault occurs and is escalated to a hard fault because of priority, the hard fault handler  whose BFAR value is overwritten.*/
#define HAL_CM4F_CFSR_BFSR_LSPERR 13	  /**< Bus fault on floating-point lazy state preservation.*/
#define HAL_CM4F_CFSR_BFSR_STKERR 12	  /**< Bus fault on stacking for exception entry. When the processor sets this bit to 1, the  SP is still adjusted but the values in the context area on the stack might be incorrect. The  processor does not write a fault address to the BFAR.*/
#define HAL_CM4F_CFSR_BFSR_UNSTKERR 11	  /**< Bus fault on unstacking for a return from exception. This fault is chained to the handler. This means that when the processor sets this bit to 1, the original return stack is still present. The processor does not adjust the SP from the failing return, does not performed a new save, and does not write a fault address to the BFAR.*/
#define HAL_CM4F_CFSR_BFSR_IMPRECISERR 10 /**< Imprecise data bus error. When the processor sets this bit to 1, it does not write a fault address to the BFAR. This is an asynchronous fault. Therefore, if it is detected when the priority of the current process is higher than the bus fault priority, the bus fault becomes pending and becomes active only when the processor returns from all higher priority processes. If a precise fault occurs before the processor enters the handler for the imprecise bus fault, the handler detects both IMPRECISERR set to 1 and one of the precise fault status bits set to 1.*/
#define HAL_CM4F_CFSR_BFSR_PRECISERR 9	  /**< Precise data bus error. When the processor sets this bit is 1, it writes the faulting address to the BFAR.*/
#define HAL_CM4F_CFSR_BFSR_IBUSERR 8	  /**< Instruction bus error. The processor detects the instruction bus error on prefetching an instruction, but it sets the IBUSERR flag to 1 only if it attempts to issue the faulting instruction.*/

// Memory management fault address register (MMFSR)
#define HAL_CM4F_CFSR_MMFSR_MMARVALID 7 /**< Memory Management Fault Address Register (MMAR) valid flag. If a memory management fault occurs and is escalated to a hard fault because of priority, the hard fault handler must set this bit to 0. This prevents problems on return to a stacked active memory management fault handler whose MMAR value is overwritten.*/
#define HAL_CM4F_CFSR_MMFSR_MLSPERR 5	/**< MemManage fault flag during floating-point lazy state preservation*/
#define HAL_CM4F_CFSR_MMFSR_MSTKERR 4	/**< Memory manager fault on stacking for exception entry. When this bit is 1, the SP is still adjusted but the values in the context area on the stack might be incorrect. The processor has not written a fault address to the MMAR.*/
#define HAL_CM4F_CFSR_MMFSR_MUNSTKERR 3 /**< Memory manager fault on unstacking for a return from exception. This fault is chained to the handler. This means that when this bit is 1, the original return stack is still  present. The processor has not adjusted the SP from the failing return, and has not performed a new save. The processor has not written a fault address to the MMAR.*/
#define HAL_CM4F_CFSR_MMFSR_DACCVIOL 1	/**< Data access violation flag. When this bit is 1, the PC value stacked for the exception return points to the faulting instruction. The processor has loaded the MMAR with  the address of the attempted access.*/
#define HAL_CM4F_CFSR_MMFSR_IACCVIOL 0	/**< Instruction access violation flag. This fault occurs on any access to an XN region, even the MPU is disabled or not present. When this bit is 1, the PC value stacked for the exception return points to the faulting instruction. The processor has not written a fault address to the MMAR.*/

/**
 * @brief: represents bit position for Hard fault status register (HFSR), Reset value: 0x0000 0000
 */

#define HAL_CM4F_HFSR_DEBUG_VT 31 /**< Reserved for Debug use. When writing to the register you must write 0 to this bit, otherwise behavior is unpredictable.*/
#define HAL_CM4F_HFSR_FORCED 30	  /**< Forced hard fault. Indicates a forced hard fault, generated by escalation of a fault with configurable priority that cannot be handles, either because of priority or because it is disabled. */
#define HAL_CM4F_HFSR_VECTTBL 1	  /**< Vector table hard fault. Indicates a bus fault on a vector table read during exception processing. This error is always handled by the hard fault handler. When this bit is set to 1, the PC value stacked for the exception return points to the instruction that was preempted by the exception.*/

/**
 * @brief: represents bit position for Auxiliary control register (ACTLR), Reset value: 0x0000 0000
 */

#define HAL_CM4F_ACTLR_DISOOFP 9	/**< Disables floating point instructions completing out of order with respect to integer instructions.*/
#define HAL_CM4F_ACTLR_DISFPCA 8	/**< Disables automatic update of CONTROL.FPCA. The value of this bit should be written as zero or preserved (SBZP).*/
#define HAL_CM4F_ACTLR_DISFOLD 2	/**< Disables folding of IT instructions. In some situations, the processor can start executing the first instruction in an IT block while it is still executing the IT instruction. This behavior is called IT folding, and improves performance, However, IT folding can cause jitter in looping. If a task must avoid jitter, set the DISFOLD bit to 1 before executing the task, to disable IT folding.*/
#define HAL_CM4F_ACTLR_DISDEFWBUF 1 /**< This bit only affects write buffers implemented in the Cortex-M4 processor. Disables write buffer use during default memory map accesses: This causes all BusFaults to be precise BusFaults but decreases performance because any store to memory must complete before the processor can execute the next instruction.*/
#define HAL_CM4F_ACTLR_DISMCYCINT 0 /**< Disables interrupt of multi-cycle instructions. When set to 1, disables interruption of load multiple and store multiple instructions. This increases the interrupt latency of the processor because any LDM or STM must complete before the processor can stack the current state and enter the interrupt handler.*/

