abdosalem490/stm32f407-drivers/drivers/HAL/CM4F/CM4F_reg.h
/******************************************************************************
 *
 *******************************************************************************/

/******************************************************************************
 * Typedefs
 *******************************************************************************/

/**
 * @brief: registers of SCB (system control block)
 */
typedef struct
{
	__io uint32_t CPUID;	 /**< CPUID base register. The CPUID register contains the processor part number, version, and implementation information. */
	__io uint32_t ICSR;		 /**< Interrupt control and state register. Provides: 1. A set-pending bit for the Non-Maskable Interrupt (NMI) exception. 2. Set-pending and clear-pending bits for the PendSV and SysTick exceptions. Indicates:  1. The exception number of the exception being processed. 2.  Whether there are preempted active exceptions. 3. The exception number of the highest priority pending exception. 4. Whether any interrupts are pending.*/
	__io uint32_t VTOR;		 /**< Vector table offset register.*/
	__io uint32_t AIRCR;	 /**< Application interrupt and reset control register. The AIRCR provides priority grouping control for the exception model, endian status for data accesses, and reset control of the system. */
	__io uint32_t SCR;		 /**< System control register. accesses, and reset control of the system. */
	__io uint32_t CCR;		 /**< Configuration and control register (CCR). The CCR controls entry to Thread mode and enables: 1. The handlers for NMI, hard fault and faults escalated by FAULTMASK to ignore bus faults. 2. Trapping of divide by zero and unaligned accesses. Access to the STIR by unprivileged software.*/
	__io uint32_t SHPR1;	 /**< System handler priority registers 1. The SHPR1-SHPR3 registers set the priority level, 0 to 255 of the exception handlers that have configurable priority. SHPR1-SHPR3 are byte accessible. */
	__io uint32_t SHPR2;	 /**< System handler priority registers 2. The SHPR1-SHPR3 registers set the priority level, 0 to 255 of the exception handlers that have configurable priority. SHPR1-SHPR3 are byte accessible. */
	__io uint32_t SHPR3;	 /**< System handler priority registers 3. The SHPR1-SHPR3 registers set the priority level, 0 to 255 of the exception handlers that have configurable priority. SHPR1-SHPR3 are byte accessible. */
	__io uint32_t SHCSR;	 /**< System handler control and state register. enables the system handlers, and indicates: 1. The pending status of the bus fault, memory management fault, and SVC exceptions. 2. The active status of the system handlers.  */
	__io uint32_t CFSR;		 /**< Configurable fault status register (CFSR; UFSR+BFSR+MMFSR). Configurable fault status register (CFSR; UFSR+BFSR+MMFSR): 1. Usage fault status register (UFSR). 2. Bus fault status register (BFSR). 3. Memory management fault address register (MMFSR)*/
	__io uint32_t HFSR;		 /**< Hard fault status register (HFSR). The HFSR gives information about events that activate the hard fault handler. This register is read, write to clear. This means that bits in the register read normally, but writing 1 to any  bit clears that bit to 0.*/
	__io uint32_t Reserved2; /**< Reserved*/
	__io uint32_t MMAR;		 /**< Memory management fault address register (MMFAR). When the MMARVALID bit of the MMFSR is set to 1, this field holds the address of the location that generated the memory management fault. When an unaligned access faults, the address is the actual address that faulted. Because a  single read or write instruction can be split into multiple aligned accesses, the fault address  can be any address in the range of the requested access size. */
	__io uint32_t BFAR;		 /**< Bus fault address register (BFAR). When the BFARVALID bit of the BFSR is set to 1, this field holds the address of the location that generated the bus fault. When an unaligned access faults the address in the BFAR is the one requested by the instruction, even if it is not the address of the fault. */
	__io uint32_t AFSR;		 /**< Auxiliary fault status register (AFSR). Implementation defined. The AFSR contains additional system fault information. The bits map to the AUXFAULT input signals. This register is read, write to clear. This means that bits in the register read normally, but writing 1 to any bit clears that bit to 0. Each AFSR bit maps directly to an AUXFAULT input of the processor, and a single-cycle HIGH signal on the input sets the corresponding AFSR bit to one. It remains set to 1 until you write 1 to the bit to clear it to zero. When an AFSR bit is latched as one, an exception does not occur. Use an interrupt if an exception is required.*/
} HAL_CM4F_SCBRegDef_t;

/******************************************************************************
 * Variables
 *******************************************************************************/

/**
 * @brief: pointers through which we will access our registers
 */
__io HAL_CM4F_SCBRegDef_t *global_pSCBReg_t = (HAL_CM4F_SCBRegDef_t *)HAL_CM4F_SCB_BASE_ADDR;
__io uint32_t *global_pu32ACTLRreg_t = (uint32_t *)HAL_CM4F_ACTLR_BASE_ADDR;

/******************************************************************************
 * Function Prototypes
 *******************************************************************************/

/*** End of File **************************************************************/
#endif /*HAL_CM4F_REG_H_*/